pages/meta/meta.html



<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> LaTeX / Beamer presentations</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>The main path is <code>(org-mode)-&gt;[Pandoc]-&gt;(beamer)</code>.</li>
<li>Use <a href="https://github.com/gpoore/minted">minted</a> to render code samples.
This is done using a <a href="https://github.com/nick-ulle/pandoc-minted">Pandoc filter</a>.</li>
<li>Theme: <a href="https://github.com/matze/mtheme">metropolis theme</a></li>
<li>Citations: Using <a href="https://hackage.haskell.org/package/pandoc-citeproc">pandoc-citeproc</a>.</li>
</ol>
</div>


<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.1</span> Tasks</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> <span class="todo TODO">TODO</span> Generate bibliography at the end of the presentation</h4>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> <span class="todo TODO">TODO</span> Add section-wide TOC to template</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<a href="http://tex.stackexchange.com/questions/26712/how-to-make-outline-frame-in-beamer">http://tex.stackexchange.com/questions/26712/how-to-make-outline-frame-in-beamer</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.1.3</span> <span class="done DONE">DONE</span> Create a <code>Makefile</code></h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
</div>
</div>
</div>
